# -*- coding: utf-8 -*-
print("■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■  ■")
print("■ Lesson12 応用編 並列化 ■")
print("■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■  ■")
print("")
print("12-1 マルチスレッドで並列化しよう")
print("-------------------------")
print("")

print("1ファイルで連続実行するとうまく処理が走らないためファイルを分割した")
print("")

print("| マルチスレッド")
print("----------------------------------------")
print("コード/: No Output")
print("c12_1_1/スレッドの作成:")
print("c12_1_2/スレッドで実行する処理の作成:")
print("c12_1_3/スレッドをロギングする:")

print("----------------------------------------")
print("")

print("| マルチスレッド")
print("----------------------------------------")
print("コード/threading.Threadの__init__の処理: No Output")
print("c12_1_4/スレッドの名前を変更:")
print("コード/関数worker2に引数を追加: No Output")
print("c12_1_5/スレッドに引数を渡す:")

print("----------------------------------------")
print("")

print("| デーモンスレッドで待たずに処理を進めよう")
print("----------------------------------------")
print("c12_1_6/スレッドの実行:")
print("c12_1_7/デーモンスレッドの実行:")
print("c12_1_8/デーモンスレッドの実行:")

print("----------------------------------------")
print("")

print("| スレッドの一覧を取得しよう")
print("----------------------------------------")
print("c12_1_9/スレッドをまとめてjoinする:")
print("c12_1_10/hreading.enumerateを使う:")
print("c12_1_11/hreading.enumerateの結果を表示する:")

print("----------------------------------------")
print("")

print("| タイマースレッド開始までの時間を開始しよう")
print("----------------------------------------")
print("c12_1_12/Timerを設定する:")
print("c12_1_13/Timerに引数を渡す:")

print("----------------------------------------")
print("")

print("| LockとRLockでスレッドの実行を制御しよう")
print("----------------------------------------")
print("c12_1_14/辞書型を並列に更新する:")
print("c12_1_15/辞書型を並列に更新する:")
print("コード/ロック:")
print("c12_1_16/ロック:")
print("c12_1_17/with文を使ったロック:")

print("----------------------------------------")
print("")

print("<RLockで2回ロックする>")
print("----------------------------------------")
print("c12_1_18/ロックの中のロック:")

print("----------------------------------------")
print("c12_1_19/RLock:")

print("----------------------------------------")
print("")

print("| セマフォでスレッドの数を制御しよう")
print("----------------------------------------")
print("c12_1_20/ロック:")
print("c12_1_21/セマフォ:")

print("----------------------------------------")
print("12-1終了")