# -*- coding: utf-8 -*-
print("■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■  ■")
print("■ Lesson12 応用編 並列化 ■")
print("■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■  ■")
print("")
print("12-2 マルチスプロセスによる並列化")
print("-------------------------")
print("")

print("1ファイルで連続実行するとうまく処理が走らないためファイルを分割した")
print("")

print("| マルチスプロセスで並列化の処理を実行してみよう")
print("----------------------------------------")
print("c12_2_1/スレッドの処理の例:")
print("コード/プロセスの処理の準備:")
print("c12_2_2/プロセスの作成:")
print("c12_2_3/プロセスのデーモン化:")

print("----------------------------------------")
print("")

print("| プールでプロセスの数を制限しよう")
print("----------------------------------------")
print("c12_2_4/プロセスのプールを作成:")
print("c12_2_5/プロセスのプールを作成:")
print("c12_2_6/プロセスの数を制限する:")

print("----------------------------------------")
print("")

print("<タイムアウトを設定する>")
print("----------------------------------------")
print("c12_2_7/タイムアウトを設定する:")

print("----------------------------------------")
print("")

print("| プールを使って次の処理の実行をブロックしよう")
print("----------------------------------------")
print("c12_2_8/並列化せずに実行する:")

print("----------------------------------------")
print("")

print("| プールとマップで複数のプロセスを一気に実行しよう")
print("----------------------------------------")
print("c12_2_9/apply_asyncで１つずつ実行する:")

print("----------------------------------------")
print("")

print("<map_asyncで非同期に実行>")
print("----------------------------------------")
print("c12_2_11/マップで非同期にプロセスを実行する:")
print("c12_2_12/マップでの実行にtimeoutを設定する:")

print("----------------------------------------")
print("")

print("<imapで結果をイテレーターで取得>")
print("----------------------------------------")
print("c12_2_13/imap:")
print("c12_2_14/imap:")

print("----------------------------------------")
print("")

print("Point/リスト内包表記を使わずにimapで実行:")
print("----------------------------------------")
print("c12_2_15/imap:")

print("----------------------------------------")
print("")

print("| プロセス間でデータのやりとりをするには？")
print("----------------------------------------")
print("c12_2_16/マルチスレッドでメモリを参照する:")
print("c12_2_17/マルチスレッドでメモリを参照する:")

print("----------------------------------------")
print("")

print("| パイプを使ってプロセス間でデータを受け渡そう")
print("----------------------------------------")
print("コード/パイプを作成する:")
print("コード/パイプでデータを送信する:")
print("c12_2_18/パイプでデータを受け取る:")

print("----------------------------------------")
print("")

print("<パイプでデータを受診するタイミング>")
print("----------------------------------------")
print("c12_2_19/パイプでデータを受信するタイミング:")
print("c12_2_20/パイプでデータを受信するタイミング:")

print("----------------------------------------")
print("12-2終了")