print("■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■")
print("■ Lesson1 入門編 Pythonの基本 ■")
print("■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■")
print("")
print("1-1 変数の宣言と数値の計算をマスターしよう")
print("-----------------------------------")
print("")

print("| 変数を宣言しよう")
print("<変数の宣言>")
print("----------------------------------------")
print("c1_1_1/数値型の変数の宣言:")
num = 1
print(num)

print("----------------------------------------")
print("c1_1_2/文字列型の変数の宣言:")
name = 'Mike'
print(name)

print("----------------------------------------")

print("")
print("<変数の型>")
print("----------------------------------------")
print("c1_1_3/変数の型を確認する:")
num = 1
name = 'Mike'
print(num, type(num))
print(name, type(name))

print("----------------------------------------")
print("c1_1_4/Boolean型の変数の宣言:")
is_ok = True
print(is_ok, type(is_ok))

print("----------------------------------------")
print("Point/変数に違う型の値を入れる:")
print("c1_1_5/変数に違う型の値を入れる:")
num = 1
name = 'Mike'
num = name
print(num, type(num))

print("----------------------------------------")
print("")

print("<型の変換>")
print("----------------------------------------")
print("c1_1_6/型変換:")
name = '1'
new_num = int(name)
print(new_num, type(new_num))

print("----------------------------------------")
print("")

print("<型の宣言>")
print("----------------------------------------")
print("c1_1_7/型宣言:")
num: int = 1
name: str = '1'
print("c1_1_7: No Output")

print("----------------------------------------")
print("c1_1_8/型宣言をした変数に違う型の値を入れる:")
num: int = 1
name: str = '1'

num = name

print(num, type(num))

print("----------------------------------------")
print("")

print("<変数名に使える文字、記号>")
print("----------------------------------------")
print("c1_1_9/戦闘が数字の名前:")
# 1num = 1
print("*** Error Output ***")
err_msg = """\
    1num = 1
    ^
SyntaxError: invalid decimal literal\
"""
print(err_msg)

print("----------------------------------------")
print("c1_1_10/数字を最後の文字にする／ _を最初の文字にする:")
num1 = 1
_num = 1

print("----------------------------------------")
print("c1_1_10: No Output")

print("----------------------------------------")
print("c1_1_11/予約語の変数名:")
# if = 1
print("*** Error Output ***")
err_msg = """\
    if = 1
       ^
SyntaxError: invalid syntax\
"""
print(err_msg)

print("----------------------------------------")
print("")

print("| printで画面に出力しよう")
print("<画面に出力する>")
print("----------------------------------------")
print("c1_1_12/printで出力:")
print('Hi')

print("----------------------------------------")
print("")

print("<複数の文字列を出力する>")
print("----------------------------------------")
print("c1_1_13/複数の文字列を出力:")
print('Hi', 'Mike')

print("----------------------------------------")
print("c1_1_14/区切り文字を指定する:")
print('Hi', 'Mike', sep=',')

print("----------------------------------------")
print("c1_1_15/終わりの文字を指定する:")
print('Hi', 'Mike', sep=',', end='\n')
print('Hi', 'Mike', sep=',', end='\n')

print("----------------------------------------")
print("c1_1_16/終わりの文字を指定する:")
print('Hi', 'Mike', sep=',', end='')
print('Hi', 'Mike', sep=',', end='')

print("----------------------------------------")
print("c1_1_17/終わりの文字を指定する:")
print('Hi', 'Mike', sep=',', end='.\n')

print("----------------------------------------")
print("")

print("| 数値の計算をしよう")
print("<数値の計算>")
print("----------------------------------------")
print("c1_1_18/足し算:")
print(2 + 2)

print("----------------------------------------")
print("対話型/足し算:")
print(2 + 2)

print("----------------------------------------")
print("対話型/引き算:")
print(5 - 2)

print("----------------------------------------")
print("対話型/掛け算:")
print(5 * 6)

print("----------------------------------------")
print("")

print("Point: 計算の順番")
print("----------------------------------------")
print("対話型/計算の順番:")
print(50 - 5 * 6)

print("----------------------------------------")
print("対話型/計算の順番:")
print((50 - 5) * 6)

print("----------------------------------------")
print("対話型/割り算:")
print(8 / 5)

print("----------------------------------------")
print("対話型/整数の型:")
print(type(1))

print("----------------------------------------")
print("対話型/少数の型:")
print(type(1.6))

print("----------------------------------------")
print("対話型/小数の書き方:")
print(0.6)
print(.6)

print("----------------------------------------")
print("対話型/割り切れない割り算:")
print(17 / 3)

print("----------------------------------------")
print("対話型/割り算の商を求める:")
print(17 // 3)

print("----------------------------------------")
print("対話型/割り算の剰余を求める:")
print(17 % 3)

print("----------------------------------------")
print("対話型/冪乗の計算:")
print(5 * 5)
print(5 ** 2)

print("----------------------------------------")
print("対話型/冪乗の計算:")
print(5 * 5 * 5 * 5 * 5)
print(5 ** 5)

print("----------------------------------------")
print("対話型/対話型シェルで変数を定義する:")
x = 5
print(x)

print("----------------------------------------")
print("対話型/変数同士の計算:")
x = 5
print(x)
y = 10
print(y)
print(x * y)

print("----------------------------------------")
print("")

print("Point/定義されていない変数:")
print("----------------------------------------")
# a
print("*** Error Output ***")
err_msg = """\
a : 用語 'a' は、コマンドレット、関数、スクリプト ファイル 、または操作可能なプログラムの名前として認識されません。名前が正しく記述されていることを確認し、パスが含ま れている場合はそのパスが正しいことを確認してから、再試行してください。
発生場所 行:1 文字:1
+ a
+ ~
    + CategoryInfo          : ObjectNotFound: (a:String)  
   [], CommandNotFoundException
    + FullyQualifiedErrorId : CommandNotFoundException\
"""
print(err_msg)

print("----------------------------------------")
print("対話型/数値を丸める:")
pie = 3.14159265358979
print(pie)
print(round(pie, 2))

print("----------------------------------------")
print("対話型/対話型シェルを終了する: No Output")
# exit()

print("----------------------------------------")
print("")

print("<数学関数を用いた計算>")
print("----------------------------------------")
print("c1_1_19/平方根の計算:")
import math

result = math.sqrt(25)
print(result)

print("----------------------------------------")
print("c1_1_20/対数の計算:")
import math

result = math.log2(10)
print(result)

print("----------------------------------------")
print("c1_1_21/help関数:")
import math

print(help(math))

print("----------------------------------------")
print("1-1終了")